# Homebrew Bundle
# 更新: brew bundle dump --file=~/config/Brewfile --force
# 還原: brew bundle install --file=~/config/Brewfile

# --- Taps ---
tap "charmbracelet/tap"
tap "chmouel/lazyworktree", "https://github.com/chmouel/lazyworktree"
tap "ellie/atuin"
tap "hashicorp/tap"
tap "homebrew/cask-versions"
tap "kardolus/chatgpt-cli"
tap "ngrok/ngrok"
tap "raine/workmux"
tap "shivammathur/php"

# --- CLI tools ---
brew "ack"
brew "atuin"
brew "autoconf"
brew "bash"
brew "binutils"
brew "btop"
brew "caddy"
brew "cmake"
brew "coreutils"
brew "curl"
brew "deno"
brew "dep-tree"
brew "diffutils"
brew "ed"
brew "emacs", link: false
brew "enchant"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fnm"
brew "fonttools"
brew "freetds"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gd"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnupg"
brew "graphviz"
brew "grep"
brew "gzip"
brew "httpie"
brew "httpstat"
brew "imagemagick"
brew "jless"
brew "jpeg"
brew "jq"
brew "lazygit"
brew "lilypond"
brew "minikube"
brew "mitmproxy"
brew "mkcert"
brew "mtr"
brew "ngrep"
brew "numpy"
brew "openjdk"
brew "osv-scanner"
brew "p7zip"
brew "pandoc"
brew "php", link: false
brew "pillow"
brew "pinentry-mac"
brew "postgrest"
brew "pv"
brew "pyenv"
brew "python@3.11"
brew "python@3.12"
brew "qpdf"
brew "rakudo"
brew "rbenv"
brew "ripgrep"
brew "ruby"
brew "screen"
brew "sevenzip"
brew "sniffnet"
brew "sops"
brew "telnet"
brew "terraformer"
brew "terragrunt"
brew "tig"
brew "tmux"
brew "tree"
brew "watch"
brew "wdiff"
brew "weasyprint"
brew "wget"
brew "youtube-dl"
brew "zlib"
brew "zlib-ng"
brew "charmbracelet/tap/mods"
brew "charmbracelet/tap/soft-serve"
brew "hashicorp/tap/terraform"
brew "raine/workmux/workmux"
brew "shivammathur/php/php@7.4", link: true

# --- GUI applications ---
cask "amethyst"
cask "devutils"
cask "emacs-app"
cask "wave"
cask "wine@staging"
cask "chmouel/lazyworktree/lazyworktree"
cask "ngrok/ngrok/ngrok"

# --- VS Code extensions ---
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "anthropic.claude-code"
vscode "astral-sh.ty"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bscan.raku-navigator"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "ducfilan.pug-formatter"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "lfs.vscode-emacs-friendly"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "pavellev.trailing-spaces"
vscode "rokoroku.vscode-theme-darcula"
vscode "rvest.vs-code-prettier-eslint"
vscode "scriplit.perl6-lsp"
vscode "tuttieee.emacs-mcx"
vscode "vue.volar"
vscode "wscats.eno"

# --- Cargo ---
# cargo "code2prompt"  # 需要先安裝 Rust: curl --proto '=https' --tlsv1.2 -sSf https://sh.rustup.rs | sh
